data/Case/0/ElPot
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          ElPot;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 2 -3 0 0 -1 0]; // [kg * m^2 /( s^3 A)]

internalField   uniform 0;

boundaryField
{
    ehv        
    {   
       
	type            fixedValue;
        value           uniform 20000; 
      }

    elv       
    {
      type            fixedValue;
      value           uniform  0;  
    }

    freeField       
    {
      type            zeroGradient;
//      value           uniform  0;  
    }
}


// ************************************************************************* //
