data/Case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 101325;

boundaryField
{
    ehv
    {
        type            fixedValue;
	value		uniform 0;
// 	type            zeroGradient;
    }

    elv
    {
        type            zeroGradient;
    }

    freeField
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
