data/Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    ehv
    {
        type            patch;
        nFaces          100;
        startFace       111900;
    }
    elv
    {
        type            patch;
        nFaces          100;
        startFace       112000;
    }
    freeField
    {
        type            patch;
        nFaces          16000;
        startFace       112100;
    }
)

// ************************************************************************* //
